In [1]:
import sys

In [2]:
sys.version_info

In [3]:
if sys.platform == 'darwin' :
    print(" Mac OS ")
else :
    print(' Windows ')

In [4]:
import pandas as pd

## 한글 처리

In [5]:
from matplotlib import font_manager, rc
import matplotlib.pyplot as plt
import sys

if sys.platform == 'darwin' :
    rc('font', family='AppleGothic')

    plt.rcParams['axes.unicode_minus'] = False
else :
    
    font_name = font_manager.FontProperties(fname="c:/Windows/Fonts/malgun.ttf").get_name()
    rc('font', family=font_name)

## 머신러닝 탐구생활

In [6]:
df = pd.read_csv("./data/santanter_product_30000.csv")

In [7]:
df = df.drop("Unnamed: 0",axis=1)

In [8]:
df.columns

Index(['fecha_dato', 'ncodpers', 'ind_empleado', 'pais_residencia', 'sexo',
       'age', 'fecha_alta', 'ind_nuevo', 'antiguedad', 'indrel',
       'ult_fec_cli_1t', 'indrel_1mes', 'tiprel_1mes', 'indresi', 'indext',
       'conyuemp', 'canal_entrada', 'indfall', 'tipodom', 'cod_prov',
       'nomprov', 'ind_actividad_cliente', 'renta', 'segmento',
       'ind_ahor_fin_ult1', 'ind_aval_fin_ult1', 'ind_cco_fin_ult1',
       'ind_cder_fin_ult1', 'ind_cno_fin_ult1', 'ind_ctju_fin_ult1',
       'ind_ctma_fin_ult1', 'ind_ctop_fin_ult1', 'ind_ctpp_fin_ult1',
       'ind_deco_fin_ult1', 'ind_deme_fin_ult1', 'ind_dela_fin_ult1',
       'ind_ecue_fin_ult1', 'ind_fond_fin_ult1', 'ind_hip_fin_ult1',
       'ind_plan_fin_ult1', 'ind_pres_fin_ult1', 'ind_reca_fin_ult1',
       'ind_tjcr_fin_ult1', 'ind_valo_fin_ult1', 'ind_viv_fin_ult1',
       'ind_nomina_ult1', 'ind_nom_pens_ult1', 'ind_recibo_ult1'],
      dtype='object')

### 고용지표 :
     A : 고용, B : 이전 F: filial N : Not, P: passive

In [9]:
df.ind_empleado.value_counts()

N    99317
Name: ind_empleado, dtype: int64

## 1.  고객 거주국가

### 국가코드 가져오기

In [10]:
country_code = pd.read_csv("./data/country_code.csv", encoding="cp949")

In [11]:
country_code.head()

  나라 이름   숫자 alpha-3 alpha-2
0    가나  288     GHA      GH
1    가봉  266     GAB      GA
2  가이아나  328     GUY      GY
3   감비아  270     GMB      GM
4  건지 섬  831     GGY      GG

In [12]:
res = [*df.pais_residencia.value_counts().index]

In [13]:
res[:2]

['ES', 'GB']

### 국가 코드 매핑하기

In [14]:
for i in res :
    if i in [*country_code['alpha-2']] :
        print(i, country_code[country_code['alpha-2'] == i]['나라 이름'].values)

ES ['스페인']
GB ['영국']
MX ['멕시코']
DE ['독일']
FR ['프랑스']
CO ['콜롬비아']
CH ['스위스']
AR ['아르헨티나']
PT ['포르투갈']
DO ['도미니카 공화국']
NL ['네덜란드']
HN ['온두라스']
VE ['베네수엘라']
FI ['핀란드']
BR ['브라질']
CL ['칠레']
BE ['벨기에']
EC ['에콰도르']
CN ['중화인민공화국']
IT ['이탈리아']
AT ['오스트리아']
TW ['중화민국']
CA ['캐나다']
US ['미국']
PL ['폴란드']
SE ['스웨덴']
PE ['페루']
NI ['니카라과']
AL ['알바니아']
IE ['아일랜드']
MZ ['모잠비크']
IN ['인도']
CR ['코스타리카']

## sexo 성별
        H : 남성,  V: 여성

In [15]:
df.sexo.value_counts()

H    53407
V    45910
Name: sexo, dtype: int64

# 2. 첫 거래일자 fecha_alta

In [16]:
df.fecha_alta.value_counts().head()

2012-08-06    1431
2012-08-03    1405
2012-08-02    1377
2012-08-01    1269
2012-08-09    1259
Name: fecha_alta, dtype: int64

### 자료형을 날짜로 변경

In [88]:
grouped = df.groupby('fecha_dato')

In [93]:
df['fecha_dato'].dtype

dtype('O')

In [95]:
df['fecha_dato'] = pd.to_datetime(df['fecha_dato'])

### dt 를 가지고 년도 월 일 로 분리

In [97]:
df['fecha_dato'].dt.year[:3]

0    2015
1    2015
2    2015
Name: fecha_dato, dtype: int64

In [99]:
df['fecha_dato'].dt.month[:10]

0    1
1    1
2    1
3    1
4    1
5    1
6    1
7    1
8    1
9    1
Name: fecha_dato, dtype: int64

In [101]:
df['fecha_dato'].dt.day[:10]

0    28
1    28
2    28
3    28
4    28
5    28
6    28
7    28
8    28
9    28
Name: fecha_dato, dtype: int64

# 3. 각 열에 대한 정보 확인

## 신규 고객지표
      6개월 이내는 1

In [18]:
df.ind_nuevo.value_counts()

0.0    99296
1.0       21
Name: ind_nuevo, dtype: int64

In [19]:
nuevo = df[df.ind_nuevo == 1.0]

In [20]:
nuevo.shape

(21, 48)

## 은행거래 누적 기간(월) 

    NA 값 제거

In [21]:
df.antiguedad = df.antiguedad.astype('str')

In [22]:
df.antiguedad = df.antiguedad.str.replace('NA','0')

In [23]:
df.antiguedad = df.antiguedad.astype('int')

In [24]:
antiguedad = df.antiguedad.value_counts()

In [25]:
df.antiguedad.isna().sum()

0

In [26]:
antiguedad.head(20)

33    15648
36    12058
35    11788
34    11684
32    10899
46    10139
47     7736
31     4226
30     2189
38     1770
27     1678
37     1519
29     1501
45     1428
28     1258
57      704
0       687
58      592
59      555
39      554
Name: antiguedad, dtype: int64

## 고객등급  indrel 
      1.0 :  1등급  99: 해당달에 1등급 해제

In [27]:
df.indrel.value_counts()

1.0     99189
99.0      128
Name: indrel, dtype: int64

##  1등급 마지막 날짜 : 'ult_fec_cli_1t'

In [28]:
df[df.indrel == 99.0]['ult_fec_cli_1t'].head()

509     2015-07-02
2061    2015-07-02
2624    2015-07-23
4306    2015-07-06
5451    2015-07-30
Name: ult_fec_cli_1t, dtype: object

## 월초 고급 등급   'indrel_1mes'

      1: 1  등급 , 2 : co-owner 3: former primary P: potential 4: former co-owner

In [29]:
df.indrel_1mes.value_counts()

1.0    99314
3.0        3
Name: indrel_1mes, dtype: int64

## 월초  기준 고객 관계 유형 

        A : active. I: inactive P : former customer R: potential

In [30]:
df.tiprel_1mes.value_counts()

I    62830
A    36484
P        3
Name: tiprel_1mes, dtype: int64

## 거주 지표

       동일국가 s , 아닌경우 n

In [31]:
df.indresi.value_counts()

S    99231
N       86
Name: indresi, dtype: int64

## 외국인 지표, 고객의 태어난 국가와 은행 걸래 국가

       동일국가 s , 아닌경우 n

In [32]:
df.indext.value_counts()

N    95061
S     4256
Name: indext, dtype: int64

##  배우자가 은행원인 지표 (1)

In [33]:
 df.conyuemp.value_counts()

Series([], Name: conyuemp, dtype: int64)

## 고객 유입 채널

In [34]:
df.canal_entrada.value_counts().head()

KHE    72720
KFC    14271
KAT     5718
KHD     3835
KFA     1630
Name: canal_entrada, dtype: int64

## 고객 사망유뮤

In [35]:
df.indfall.value_counts()

N    99296
S       21
Name: indfall, dtype: int64

##  주소유형 : 1 주거주지

In [36]:
df.tipodom.value_counts()

1.0    99317
Name: tipodom, dtype: int64

## 지방 코드

In [37]:
df.cod_prov.value_counts().head()

28.0    16113
8.0     11080
41.0     5261
15.0     5211
30.0     4140
Name: cod_prov, dtype: int64

## 지방 이름

In [38]:
df.nomprov.head()

0         MALAGA
1    CIUDAD REAL
2    CIUDAD REAL
3       ZARAGOZA
4       ZARAGOZA
Name: nomprov, dtype: object

## 활성화 지표  1. 활성화

In [39]:
df.ind_actividad_cliente.value_counts()

0.0    58567
1.0    40750
Name: ind_actividad_cliente, dtype: int64

## 총수입

In [40]:
df.renta.value_counts().head()

488798.49    16
283325.67    16
82317.33     12
124220.73     8
44958.90      8
Name: renta, dtype: int64

## 고객 분류

In [41]:
df.segmento.value_counts()

03 - UNIVERSITARIO    75157
02 - PARTICULARES     22919
01 - TOP               1233
Name: segmento, dtype: int64

## 상품정보 

    1: 가입

### 예금

In [42]:
df.ind_ahor_fin_ult1.value_counts()

0    100000
Name: ind_ahor_fin_ult1, dtype: int64

### 보증

In [43]:
df.ind_aval_fin_ult1.value_counts()

0    100000
Name: ind_aval_fin_ult1, dtype: int64

### 당좌예금

In [44]:
df.ind_cco_fin_ult1.value_counts()

1    90327
0     9673
Name: ind_cco_fin_ult1, dtype: int64

### 파생상품계좌

In [45]:
df.ind_cder_fin_ult1.value_counts()

0    99996
1        4
Name: ind_cder_fin_ult1, dtype: int64

### 급여계정

In [46]:
df.ind_cno_fin_ult1.value_counts()

0    94613
1     5387
Name: ind_cno_fin_ult1, dtype: int64

### 청소년 계정

In [47]:
df.ind_ctju_fin_ult1.value_counts()

0    99061
1      939
Name: ind_ctju_fin_ult1, dtype: int64

### 마스 특별계정

In [48]:
df.ind_ctma_fin_ult1.value_counts()

0    98406
1     1594
Name: ind_ctma_fin_ult1, dtype: int64

### 특별계정

In [49]:
df.ind_ctop_fin_ult1.value_counts()

0    99993
1        7
Name: ind_ctop_fin_ult1, dtype: int64

### 특정 플러스 계정

In [50]:
df.ind_ctpp_fin_ult1.value_counts()

0    99990
1       10
Name: ind_ctpp_fin_ult1, dtype: int64

### 단기예금

In [51]:
df.ind_deco_fin_ult1.value_counts()

0    99980
1       20
Name: ind_deco_fin_ult1, dtype: int64

### 중기예금

In [52]:
df.ind_deme_fin_ult1.value_counts()

0    99966
1       34
Name: ind_deme_fin_ult1, dtype: int64

### 장기예금

In [53]:
df.ind_dela_fin_ult1.value_counts()

0    97900
1     2100
Name: ind_dela_fin_ult1, dtype: int64

### e-계정

In [54]:
df.ind_ecue_fin_ult1.value_counts()

0    92898
1     7102
Name: ind_ecue_fin_ult1, dtype: int64

### 펀드

In [55]:
df.ind_fond_fin_ult1.value_counts()

0    99627
1      373
Name: ind_fond_fin_ult1, dtype: int64

### 부동산 대출

In [56]:
df.ind_hip_fin_ult1.value_counts()

0    99989
1       11
Name: ind_hip_fin_ult1, dtype: int64

### 연금

In [57]:
df.ind_plan_fin_ult1.value_counts()

0    99874
1      126
Name: ind_plan_fin_ult1, dtype: int64

### 대출

In [58]:
df.ind_pres_fin_ult1.value_counts()

0    99980
1       20
Name: ind_pres_fin_ult1, dtype: int64

### 세금

In [59]:
df.ind_reca_fin_ult1.value_counts()

0    98075
1     1925
Name: ind_reca_fin_ult1, dtype: int64

### 신용카드

In [60]:
df.ind_tjcr_fin_ult1.value_counts()

0    98136
1     1864
Name: ind_tjcr_fin_ult1, dtype: int64

### 증권

In [61]:
df.ind_valo_fin_ult1.value_counts()

0    99537
1      463
Name: ind_valo_fin_ult1, dtype: int64

### 홈계정

In [62]:
df.ind_viv_fin_ult1.value_counts()

0    99994
1        6
Name: ind_viv_fin_ult1, dtype: int64

### 급여

In [63]:
df.ind_nomina_ult1.value_counts()

0.0    96503
1.0     3287
Name: ind_nomina_ult1, dtype: int64

### 연금

In [64]:
df.ind_nom_pens_ult1.value_counts()

0.0    96249
1.0     3541
Name: ind_nom_pens_ult1, dtype: int64

### 직불카드

In [65]:
df.ind_recibo_ult1.value_counts()

0    90224
1     9776
Name: ind_recibo_ult1, dtype: int64

In [66]:
df.head()

,fecha_dato,ncodpers,ind_empleado,pais_residencia,sexo,age,fecha_alta,ind_nuevo,antiguedad,indrel,...,ind_hip_fin_ult1,ind_plan_fin_ult1,ind_pres_fin_ult1,ind_reca_fin_ult1,ind_tjcr_fin_ult1,ind_valo_fin_ult1,ind_viv_fin_ult1,ind_nomina_ult1,ind_nom_pens_ult1,ind_recibo_ult1
0,2015-01-28,1375586,N,ES,H,35,2015-01-12,0.0,6,1.0,...,0,0,0,0,0,0,0,0.0,0.0,0
1,2015-01-28,1050611,N,ES,V,23,2012-08-10,0.0,35,1.0,...,0,0,0,0,0,0,0,0.0,0.0,0
2,2015-01-28,1050612,N,ES,V,23,2012-08-10,0.0,35,1.0,...,0,0,0,0,0,0,0,0.0,0.0,0
3,2015-01-28,1050613,N,ES,H,22,2012-08-10,0.0,35,1.0,...,0,0,0,0,0,0,0,0.0,0.0,0
4,2015-01-28,1050614,N,ES,V,23,2012-08-10,0.0,35,1.0,...,0,0,0,0,0,0,0,0.0,0.0,0

In [67]:
df.shape

(100000, 48)

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 48 columns):
fecha_dato               100000 non-null object
ncodpers                 100000 non-null int64
ind_empleado             99317 non-null object
pais_residencia          99317 non-null object
sexo                     99317 non-null object
age                      100000 non-null object
fecha_alta               99317 non-null object
ind_nuevo                99317 non-null float64
antiguedad               100000 non-null int32
indrel                   99317 non-null float64
ult_fec_cli_1t           128 non-null object
indrel_1mes              99317 non-null float64
tiprel_1mes              99317 non-null object
indresi                  99317 non-null object
indext                   99317 non-null object
conyuemp                 0 non-null float64
canal_entrada            99312 non-null object
indfall                  99317 non-null object
tipodom                  99317 non-null float64
cod_prov                 99231 non-null float64
nomprov                  99231 non-null object
ind_actividad_cliente    99317 non-null float64
renta                    81716 non-null float64
segmento                 99309 non-null object
ind_ahor_fin_ult1        100000 non-null int64
ind_aval_fin_ult1        100000 non-null int64
ind_cco_fin_ult1         100000 non-null int64
ind_cder_fin_ult1        100000 non-null int64
ind_cno_fin_ult1         100000 non-null int64
ind_ctju_fin_ult1        100000 non-null int64
ind_ctma_fin_ult1        100000 non-null int64
ind_ctop_fin_ult1        100000 non-null int64
ind_ctpp_fin_ult1        100000 non-null int64
ind_deco_fin_ult1        100000 non-null int64
ind_deme_fin_ult1        100000 non-null int64
ind_dela_fin_ult1        100000 non-null int64
ind_ecue_fin_ult1        100000 non-null int64
ind_fond_fin_ult1        100000 non-null int64
ind_hip_fin_ult1         100000 non-null int64
ind_plan_fin_ult1        100000 non-null int64
ind_pres_fin_ult1        100000 non-null int64
ind_reca_fin_ult1        100000 non-null int64
ind_tjcr_fin_ult1        100000 non-null int64
ind_valo_fin_ult1        100000 non-null int64
ind_viv_fin_ult1         100000 non-null int64
ind_nomina_ult1          99790 non-null float64
ind_nom_pens_ult1        99790 non-null float64
ind_recibo_ult1          100000 non-null int64
dtypes: float64(10), int32(1), int64(23), object(14)
memory usage: 36.2+ MB

# 4.결측값 제거

In [69]:
df1 = df.dropna(axis=1)

In [70]:
df1.shape

(100000, 26)

In [71]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 26 columns):
fecha_dato           100000 non-null object
ncodpers             100000 non-null int64
age                  100000 non-null object
antiguedad           100000 non-null int32
ind_ahor_fin_ult1    100000 non-null int64
ind_aval_fin_ult1    100000 non-null int64
ind_cco_fin_ult1     100000 non-null int64
ind_cder_fin_ult1    100000 non-null int64
ind_cno_fin_ult1     100000 non-null int64
ind_ctju_fin_ult1    100000 non-null int64
ind_ctma_fin_ult1    100000 non-null int64
ind_ctop_fin_ult1    100000 non-null int64
ind_ctpp_fin_ult1    100000 non-null int64
ind_deco_fin_ult1    100000 non-null int64
ind_deme_fin_ult1    100000 non-null int64
ind_dela_fin_ult1    100000 non-null int64
ind_ecue_fin_ult1    100000 non-null int64
ind_fond_fin_ult1    100000 non-null int64
ind_hip_fin_ult1     100000 non-null int64
ind_plan_fin_ult1    100000 non-null int64
ind_pres_fin_ult1    100000 non-null int64
ind_reca_fin_ult1    100000 non-null int64
ind_tjcr_fin_ult1    100000 non-null int64
ind_valo_fin_ult1    100000 non-null int64
ind_viv_fin_ult1     100000 non-null int64
ind_recibo_ult1      100000 non-null int64
dtypes: int32(1), int64(23), object(2)
memory usage: 19.5+ MB

In [72]:
df1.head()

,fecha_dato,ncodpers,age,antiguedad,ind_ahor_fin_ult1,ind_aval_fin_ult1,ind_cco_fin_ult1,ind_cder_fin_ult1,ind_cno_fin_ult1,ind_ctju_fin_ult1,...,ind_ecue_fin_ult1,ind_fond_fin_ult1,ind_hip_fin_ult1,ind_plan_fin_ult1,ind_pres_fin_ult1,ind_reca_fin_ult1,ind_tjcr_fin_ult1,ind_valo_fin_ult1,ind_viv_fin_ult1,ind_recibo_ult1
0,2015-01-28,1375586,35,6,0,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2015-01-28,1050611,23,35,0,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,2015-01-28,1050612,23,35,0,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,2015-01-28,1050613,22,35,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,2015-01-28,1050614,23,35,0,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [73]:
df1.age.value_counts()

 23    22099
 24    15054
 25     8121
 22     7290
 26     6334
 27     4903
 28     3653
 29     2719
 30     2441
 31     1980
 32     1712
 33     1475
 34     1367
 35     1274
 36     1208
 37     1096
 38     1052
 39     1035
 40      980
 41      945
 42      859
 43      757
 44      718
 45      685
 NA      683
 47      606
 46      583
 48      535
 49      519
 50      508
       ...
 75       42
 81       41
 21       38
 19       37
 84       35
 78       35
 79       35
 80       34
 20       34
 86       30
 87       28
 82       28
 89       28
 88       27
  4       26
 85       25
 18       25
 90       23
 92       20
 91       17
 96       11
 94        8
 95        8
 98        6
 93        6
 99        2
100        1
101        1
106        1
 97        1
Name: age, Length: 100, dtype: int64

# 5. 상품 가입 정보 확인

## 상품 가입 건수 확인

In [74]:
df.columns

Index(['fecha_dato', 'ncodpers', 'ind_empleado', 'pais_residencia', 'sexo',
       'age', 'fecha_alta', 'ind_nuevo', 'antiguedad', 'indrel',
       'ult_fec_cli_1t', 'indrel_1mes', 'tiprel_1mes', 'indresi', 'indext',
       'conyuemp', 'canal_entrada', 'indfall', 'tipodom', 'cod_prov',
       'nomprov', 'ind_actividad_cliente', 'renta', 'segmento',
       'ind_ahor_fin_ult1', 'ind_aval_fin_ult1', 'ind_cco_fin_ult1',
       'ind_cder_fin_ult1', 'ind_cno_fin_ult1', 'ind_ctju_fin_ult1',
       'ind_ctma_fin_ult1', 'ind_ctop_fin_ult1', 'ind_ctpp_fin_ult1',
       'ind_deco_fin_ult1', 'ind_deme_fin_ult1', 'ind_dela_fin_ult1',
       'ind_ecue_fin_ult1', 'ind_fond_fin_ult1', 'ind_hip_fin_ult1',
       'ind_plan_fin_ult1', 'ind_pres_fin_ult1', 'ind_reca_fin_ult1',
       'ind_tjcr_fin_ult1', 'ind_valo_fin_ult1', 'ind_viv_fin_ult1',
       'ind_nomina_ult1', 'ind_nom_pens_ult1', 'ind_recibo_ult1'],
      dtype='object')

In [75]:
df['sum'] = df[ ['ind_ahor_fin_ult1', 'ind_aval_fin_ult1', 'ind_cco_fin_ult1',
       'ind_cder_fin_ult1', 'ind_cno_fin_ult1', 'ind_ctju_fin_ult1',
       'ind_ctma_fin_ult1', 'ind_ctop_fin_ult1', 'ind_ctpp_fin_ult1',
       'ind_deco_fin_ult1', 'ind_deme_fin_ult1', 'ind_dela_fin_ult1',
       'ind_ecue_fin_ult1', 'ind_fond_fin_ult1', 'ind_hip_fin_ult1',
       'ind_plan_fin_ult1', 'ind_pres_fin_ult1', 'ind_reca_fin_ult1',
       'ind_tjcr_fin_ult1', 'ind_valo_fin_ult1', 'ind_viv_fin_ult1',
       'ind_nomina_ult1', 'ind_nom_pens_ult1', 'ind_recibo_ult1']].sum(axis=1)

In [76]:
df['sum'].head()

0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
Name: sum, dtype: float64

In [77]:
df['sum'].value_counts()

1.0    83408
2.0     9148
3.0     3150
4.0     1822
5.0     1035
0.0      612
6.0      552
7.0      204
8.0       62
9.0        7
Name: sum, dtype: int64

## 총수입별 상품 가입

In [78]:
df_150000 = df[df['renta'] > 150000.0 ]

In [79]:
df_150000.shape

(15896, 49)

In [80]:
df_150000[df_150000['sum'] >= 7.0 ].shape

(75, 49)

In [81]:
df_200000 = df[df['renta'] > 200000.0 ]

In [82]:
df_200000.shape

(8139, 49)

In [83]:
df_200000[df_200000['sum'] >= 9.0 ]

,fecha_dato,ncodpers,ind_empleado,pais_residencia,sexo,age,fecha_alta,ind_nuevo,antiguedad,indrel,...,ind_plan_fin_ult1,ind_pres_fin_ult1,ind_reca_fin_ult1,ind_tjcr_fin_ult1,ind_valo_fin_ult1,ind_viv_fin_ult1,ind_nomina_ult1,ind_nom_pens_ult1,ind_recibo_ult1,sum
56817,2015-01-28,1119589,N,ES,H,57,2013-01-28,0.0,30,1.0,...,1,0,1,1,0,0,1.0,1.0,1,9.0
58173,2015-01-28,1116675,N,ES,V,69,2013-01-08,0.0,30,1.0,...,0,0,1,1,1,0,0.0,1.0,1,9.0

In [84]:
df_9 = df[df['sum'] == 9.0 ]

In [85]:
df_9.shape

(7, 49)

In [86]:
df_9['renta']

3955           NaN
56817    284259.75
58173    221374.08
63696    111272.31
82180    188153.91
98895    170253.24
99385          NaN
Name: renta, dtype: float64

In [102]:
df.select_dtypes(include='number').head()

,ncodpers,ind_nuevo,antiguedad,indrel,indrel_1mes,conyuemp,tipodom,cod_prov,ind_actividad_cliente,renta,...,ind_plan_fin_ult1,ind_pres_fin_ult1,ind_reca_fin_ult1,ind_tjcr_fin_ult1,ind_valo_fin_ult1,ind_viv_fin_ult1,ind_nomina_ult1,ind_nom_pens_ult1,ind_recibo_ult1,sum
0,1375586,0.0,6,1.0,1.0,NaN,1.0,29.0,1.0,87218.10,...,0,0,0,0,0,0,0.0,0.0,0,1.0
1,1050611,0.0,35,1.0,1.0,NaN,1.0,13.0,0.0,35548.74,...,0,0,0,0,0,0,0.0,0.0,0,1.0
2,1050612,0.0,35,1.0,1.0,NaN,1.0,13.0,0.0,122179.11,...,0,0,0,0,0,0,0.0,0.0,0,1.0
3,1050613,0.0,35,1.0,1.0,NaN,1.0,50.0,0.0,119775.54,...,0,0,0,0,0,0,0.0,0.0,0,1.0
4,1050614,0.0,35,1.0,1.0,NaN,1.0,50.0,1.0,NaN,...,0,0,0,0,0,0,0.0,0.0,0,1.0